In [1]:
import pandas as pd
import numpy as np

In [2]:
data = {'Sede':['SP','SP','MG','MG','RJ','RJ','ES','ES'],
       'Vendedor':['Jorge','Ana','Tiago','Pedro','Raphaela','Guto','Maria','Carolina'],
       'Vendas':[2000,2500,3100,1200,1500,3900,2900,3900]}

dataframe1 = pd.DataFrame(data)

In [3]:
dataframe1

  Sede  Vendedor  Vendas
0   SP     Jorge    2000
1   SP       Ana    2500
2   MG     Tiago    3100
3   MG     Pedro    1200
4   RJ  Raphaela    1500
5   RJ      Guto    3900
6   ES     Maria    2900
7   ES  Carolina    3900

In [4]:
#groupby

In [5]:
dataframe1.groupby('Sede')

In [6]:
by_sede = dataframe1.groupby('Sede')

In [9]:
#max, min

In [10]:
by_sede.max()

      Vendedor  Vendas
Sede
ES       Maria    3900
MG       Tiago    3100
RJ    Raphaela    3900
SP       Jorge    2500

In [11]:
by_sede.min()

      Vendedor  Vendas
Sede
ES    Carolina    2900
MG       Pedro    1200
RJ        Guto    1500
SP         Ana    2000

In [12]:
#media

In [13]:
by_sede.mean()

      Vendas
Sede
ES      3400
MG      2150
RJ      2700
SP      2250

In [16]:
#descrições estatisticas

In [17]:
by_sede.describe()

     Vendas
      count    mean          std     min     25%     50%     75%     max
Sede
ES      2.0  3400.0   707.106781  2900.0  3150.0  3400.0  3650.0  3900.0
MG      2.0  2150.0  1343.502884  1200.0  1675.0  2150.0  2625.0  3100.0
RJ      2.0  2700.0  1697.056275  1500.0  2100.0  2700.0  3300.0  3900.0
SP      2.0  2250.0   353.553391  2000.0  2125.0  2250.0  2375.0  2500.0

In [18]:
by_sede.describe().transpose()

Sede                   ES           MG           RJ           SP
Vendas count     2.000000     2.000000     2.000000     2.000000
       mean   3400.000000  2150.000000  2700.000000  2250.000000
       std     707.106781  1343.502884  1697.056275   353.553391
       min    2900.000000  1200.000000  1500.000000  2000.000000
       25%    3150.000000  1675.000000  2100.000000  2125.000000
       50%    3400.000000  2150.000000  2700.000000  2250.000000
       75%    3650.000000  2625.000000  3300.000000  2375.000000
       max    3900.000000  3100.000000  3900.000000  2500.000000

In [19]:
by_sede.describe().transpose()['SP']

Vendas  count       2.000000
        mean     2250.000000
        std       353.553391
        min      2000.000000
        25%      2125.000000
        50%      2250.000000
        75%      2375.000000
        max      2500.000000
Name: SP, dtype: float64

In [20]:
#dataframe multi index

In [22]:
arrays = [['São Paulo', 'São Paulo', 'Rio de Janeiro', 'Rio de Janeiro','Minas Gerais','Minas Gerais'],
['Garrafas','Copos','Garrafas','Copos','Garrafas','Copos' ]]
index = pd.MultiIndex.from_arrays(arrays, names=('Estado', 'Produto'))
dataframe2 = pd.DataFrame({'Total Vendido R$': [10000, 35000, 22400, 12890,10880,13900]},index=index)

In [23]:
dataframe2

                         Total Vendido R$
Estado         Produto
São Paulo      Garrafas             10000
               Copos                35000
Rio de Janeiro Garrafas             22400
               Copos                12890
Minas Gerais   Garrafas             10880
               Copos                13900

In [24]:
dataframe2.groupby('Estado', level=0)

In [25]:
multi_by_estado = dataframe2.groupby('Estado', level=0)

In [26]:
multi_by_estado.mean()

                Total Vendido R$
Estado
Minas Gerais               12390
Rio de Janeiro             17645
São Paulo                  22500

In [27]:
multi_by_estado.max()

                Total Vendido R$
Estado
Minas Gerais               13900
Rio de Janeiro             22400
São Paulo                  35000

In [28]:
multi_by_estado.min()

                Total Vendido R$
Estado
Minas Gerais               10880
Rio de Janeiro             12890
São Paulo                  10000

In [30]:
multi_by_produto = dataframe2.groupby('Produto', level=1)

In [32]:
multi_by_produto.mean()

          Total Vendido R$
Produto
Copos         20596.666667
Garrafas      14426.666667